// Список отделов компании
export const DEPARTMENTS = [
  "1С",
  "Партнерка",
  "ЦТО",
  "Сервис",
  "Крупные клиенты",
  "Отдел заявок",
  "Отдел сопровождения",
  "HoReCa",
  "Отдел Тинькофф",
  "Отдел ФН",
  "Логистика",
  "Тех. поддержка",
  "Отдел маркетинга",
  "Отдел маркетплейсы"
] as const;

// Список популярных должностей
export const POSITIONS = [
  "Разработчик",
  "Системный администратор",
  "Аналитик",
  "Менеджер",
  "Специалист",
  "Консультант",
  "Инженер",
  "Бухгалтер",
  "HR-специалист",
  "Маркетолог",
  "Менеджер по продажам",
  "Логист",
  "Охранник",
  "Юрист",
  "Директор",
  "Заместитель директора",
  "Руководитель отдела"
] as const;

export type Department = typeof DEPARTMENTS[number];
export type Position = typeof POSITIONS[number];